In [1]:
!pip install pyodbc

Requirement already satisfied: pyodbc in c:\users\syed\anaconda3\lib\site-packages (5.1.0)

In [1]:
import pyodbc

conn = pyodbc.connect(
    "Driver={SQL Server};"
    "Server=DESKTOP-VUVFCR5;"  # âœ… Your correct server name
    "Database=EmployeeSalesDB;"
    "Trusted_Connection=yes;"
)

cursor = conn.cursor()
print("âœ… Connected to SQL Server: EmployeeSalesDB")

âœ… Connected to SQL Server: EmployeeSalesDB

<span style="color: #008000;"><b>-- ðŸ“˜ STEP 1: Basic SELECT queries</b></span>



-- 1. Select all employees

In [2]:
cursor.execute("SELECT * FROM employees;")
rows = cursor.fetchall()
for row in rows:
	print(row)

(1, 'Paul', 'Garrix', 'Corporate', Decimal('6000.00'), 'paul.garrix@company.com')
(2, 'Astrid', 'Fox', 'Support', Decimal('2845.56'), None)
(3, 'Matthias', 'Johnson', 'Private Individuals', Decimal('3009.41'), None)
(4, 'Lucy', 'Patterson', 'Private Individuals', Decimal('3547.25'), None)
(5, 'Tom', 'Page', 'Corporate', Decimal('5974.41'), None)
(6, 'Claudia', 'Conte', 'Corporate', Decimal('4714.12'), None)
(7, 'Walter', 'Deer', 'Private Individuals', Decimal('3547.25'), None)
(8, 'Stephanie', 'Marx', 'Support', Decimal('2894.51'), None)
(9, 'Luca', 'Pavarotti', 'Private Individuals', Decimal('4123.45'), None)
(10, 'Victoria', 'Pollock', 'Corporate', Decimal('4789.53'), None)

In [4]:

# 2. Select employee names and salary
cursor.execute("SELECT first_name, last_name, monthly_salary FROM employees;")
rows = cursor.fetchall()
for row in rows:
	print(row)

('Paul', 'Garrix', Decimal('6000.00'))
('Astrid', 'Fox', Decimal('2845.56'))
('Matthias', 'Johnson', Decimal('3009.41'))
('Lucy', 'Patterson', Decimal('3547.25'))
('Tom', 'Page', Decimal('5974.41'))
('Claudia', 'Conte', Decimal('4714.12'))
('Walter', 'Deer', Decimal('3547.25'))
('Stephanie', 'Marx', Decimal('2894.51'))
('Luca', 'Pavarotti', Decimal('4123.45'))
('Victoria', 'Pollock', Decimal('4789.53'))

In [5]:

# 3. Select employees with salary above 4000
cursor.execute("SELECT * FROM employees WHERE monthly_salary > 4000;")
rows = cursor.fetchall()
for row in rows:
	print(row)

(1, 'Paul', 'Garrix', 'Corporate', Decimal('6000.00'), 'paul.garrix@company.com')
(5, 'Tom', 'Page', 'Corporate', Decimal('5974.41'), None)
(6, 'Claudia', 'Conte', 'Corporate', Decimal('4714.12'), None)
(9, 'Luca', 'Pavarotti', 'Private Individuals', Decimal('4123.45'), None)
(10, 'Victoria', 'Pollock', 'Corporate', Decimal('4789.53'), None)

In [7]:

# 4. Select employees from Corporate department
cursor.execute("SELECT * FROM employees WHERE department = 'Corporate';")

for row in cursor.fetchall():
    print(row)

(1, 'Paul', 'Garrix', 'Corporate', Decimal('6000.00'), 'paul.garrix@company.com')
(5, 'Tom', 'Page', 'Corporate', Decimal('5974.41'), None)
(6, 'Claudia', 'Conte', 'Corporate', Decimal('4714.12'), None)
(10, 'Victoria', 'Pollock', 'Corporate', Decimal('4789.53'), None)

In [9]:

# 5. Order employees by salary descending
cursor.execute("SELECT * FROM employees ORDER BY monthly_salary DESC;")
rows = cursor.fetchall()
for row in rows:
	print(row)

(1, 'Paul', 'Garrix', 'Corporate', Decimal('6000.00'), 'paul.garrix@company.com')
(5, 'Tom', 'Page', 'Corporate', Decimal('5974.41'), None)
(10, 'Victoria', 'Pollock', 'Corporate', Decimal('4789.53'), None)
(6, 'Claudia', 'Conte', 'Corporate', Decimal('4714.12'), None)
(9, 'Luca', 'Pavarotti', 'Private Individuals', Decimal('4123.45'), None)
(7, 'Walter', 'Deer', 'Private Individuals', Decimal('3547.25'), None)
(4, 'Lucy', 'Patterson', 'Private Individuals', Decimal('3547.25'), None)
(3, 'Matthias', 'Johnson', 'Private Individuals', Decimal('3009.41'), None)
(8, 'Stephanie', 'Marx', 'Support', Decimal('2894.51'), None)
(2, 'Astrid', 'Fox', 'Support', Decimal('2845.56'), None)

In [11]:

# 6. Get unique departments
cursor.execute("SELECT DISTINCT department FROM employees;")
departments = cursor.fetchall()
for dept in departments:
	print(dept)

('Corporate',)
('Private Individuals',)
('Support',)

In [ ]:
-- 7. Count total number of employees
SELECT COUNT(*) AS total_employees FROM employees;

In [ ]:
# 8. Get average salary of all employees
cursor.execute("SELECT AVG(monthly_salary) AS avg_salary FROM employees;")
avg_salary = cursor.fetchone()[0]
print("Average salary of all employees:", avg_salary)

Average salary of all employees: 4144.549000

In [15]:
# 9. Get total salary paid
cursor.execute("SELECT SUM(monthly_salary) AS total_salary FROM employees;")
total_salary = cursor.fetchone()[0]
print("Total salary paid:", total_salary)

Total salary paid: 41445.49

In [ ]:
# 10. Get employees with name starting with 'P'
cursor.execute("SELECT * FROM employees WHERE first_name LIKE 'P%';")
rows = cursor.fetchall()
for row in rows:
	print(row)

(1, 'Paul', 'Garrix', 'Corporate', Decimal('6000.00'), 'paul.garrix@company.com')

**\-- ðŸ“— STEP 2: Join Queries**

In [19]:
# 11. List employee names and their Q1 sales
cursor.execute("""
	SELECT e.first_name, e.last_name, qs.q1_2022
	FROM employees e
	JOIN quarterly_sales qs ON e.id = qs.employee_id;
""")
rows = cursor.fetchall()
for row in rows:
	print(row)

('Paul', 'Garrix', Decimal('8715.55'))
('Astrid', 'Fox', Decimal('4989.23'))
('Matthias', 'Johnson', Decimal('12774.51'))
('Lucy', 'Patterson', Decimal('5417.81'))
('Tom', 'Page', Decimal('6349.74'))
('Claudia', 'Conte', Decimal('2498.63'))
('Walter', 'Deer', Decimal('18415.66'))
('Stephanie', 'Marx', Decimal('3471.41'))
('Luca', 'Pavarotti', Decimal('4485.36'))
('Victoria', 'Pollock', Decimal('1547.52'))

In [21]:
# 12. Total annual sales for each employee
cursor.execute("""
    SELECT e.first_name, e.last_name,
           (qs.q1_2022 + qs.q2_2022 + qs.q3_2022 + qs.q4_2022) AS total_sales
    FROM employees e
    JOIN quarterly_sales qs ON e.id = qs.employee_id;
""")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Paul', 'Garrix', Decimal('45443.38'))
('Astrid', 'Fox', Decimal('20312.48'))
('Matthias', 'Johnson', Decimal('58233.67'))
('Lucy', 'Patterson', Decimal('30595.57'))
('Tom', 'Page', Decimal('28637.65'))
('Claudia', 'Conte', Decimal('17734.94'))
('Walter', 'Deer', Decimal('62774.59'))
('Stephanie', 'Marx', Decimal('22993.23'))
('Luca', 'Pavarotti', Decimal('25023.21'))
('Victoria', 'Pollock', Decimal('6770.16'))

In [23]:

# 13. Top 3 employees by total sales
cursor.execute("""
    SELECT TOP 3 e.first_name, e.last_name,
           (qs.q1_2022 + qs.q2_2022 + qs.q3_2022 + qs.q4_2022) AS total_sales
    FROM employees e
    JOIN quarterly_sales qs ON e.id = qs.employee_id
    ORDER BY total_sales DESC;
""")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Walter', 'Deer', Decimal('62774.59'))
('Matthias', 'Johnson', Decimal('58233.67'))
('Paul', 'Garrix', Decimal('45443.38'))

In [ ]:
# 14. Department-wise average salary
cursor.execute("""
	SELECT department, AVG(monthly_salary) AS avg_salary
	FROM employees
	GROUP BY department;
""")
rows = cursor.fetchall()
for row in rows:
	print(row)

('Corporate', Decimal('5369.515000'))
('Private Individuals', Decimal('3556.840000'))
('Support', Decimal('2870.035000'))

In [ ]:

-- 15. Total Q2 sales across all employees
SELECT SUM(q2_2022) AS total_q2_sales FROM quarterly_sales;

**\-- ðŸ“™ STEP 3: UPDATE and DELETE**

In [50]:
# 16. Update salary of an employee
cursor.execute("UPDATE employees SET monthly_salary = 6000 WHERE id = 1;")
conn.commit()
print("Salary updated for employee with id = 1")

Salary updated for employee with id = 1

In [47]:

# 17. Update department of all employees with monthly_salary < 3000
cursor.execute("UPDATE employees SET department = 'Support' WHERE monthly_salary < 3000;")
conn.commit()
print("Department updated for employees with monthly_salary < 3000")

# 18. Delete an employee record (Uncomment to run)
# cursor.execute("DELETE FROM employees WHERE id = 10;")
# conn.commit()
# print("Employee with id = 10 deleted")

Department updated for employees with monthly_salary < 3000

**\-- ðŸ“’ STEP 4: ALTER TABLE operations**

In [ ]:
-- 19. Add a new column 'email' to employees table
ALTER TABLE employees ADD email VARCHAR(100);

In [45]:
# 20. Update email for one employee
cursor.execute("UPDATE employees SET email = 'paul.garrix@company.com' WHERE id = 1;")
conn.commit()
print("Email updated for employee with id = 1")

Email updated for employee with id = 1

In [ ]:
-- 21. Rename column 'salary' to 'monthly_salary'
EXEC sp_rename 'employees.salary', 'monthly_salary', 'COLUMN';

**\-- ðŸ“• STEP 5: Aggregation + Filtering**

In [43]:

# 22. Get employees with total annual sales > 25000
cursor.execute("""
    SELECT 
      e.first_name, 
      e.last_name,
      (qs.q1_2022 + qs.q2_2022 + qs.q3_2022 + qs.q4_2022) AS total_sales
    FROM employees e
    JOIN quarterly_sales qs ON e.id = qs.employee_id
    WHERE (qs.q1_2022 + qs.q2_2022 + qs.q3_2022 + qs.q4_2022) > 25000;
""")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Paul', 'Garrix', Decimal('45443.38'))
('Matthias', 'Johnson', Decimal('58233.67'))
('Lucy', 'Patterson', Decimal('30595.57'))
('Tom', 'Page', Decimal('28637.65'))
('Walter', 'Deer', Decimal('62774.59'))
('Luca', 'Pavarotti', Decimal('25023.21'))

In [41]:
# 23. Group employees by department and count them
cursor.execute("""
	SELECT department, COUNT(*) AS employee_count
	FROM employees
	GROUP BY department;
""")
rows = cursor.fetchall()
for row in rows:
	print(row)

('Corporate', 4)
('Private Individuals', 4)
('Support', 2)

In [27]:

# 24. Maximum salary in each department
cursor.execute("""
	SELECT department, MAX(monthly_salary) AS max_salary
	FROM employees
	GROUP BY department;
""")
rows = cursor.fetchall()
for row in rows:
	print(row)

('Corporate', Decimal('6000.00'))
('Private Individuals', Decimal('4123.45'))
('Support', Decimal('2894.51'))

**\-- ðŸ“” STEP 6: Subqueries**

In [29]:
# 25. Get employees earning more than average salary
cursor.execute("""
	SELECT * FROM employees
	WHERE monthly_salary > (SELECT AVG(monthly_salary) FROM employees);
""")
rows = cursor.fetchall()
for row in rows:
	print(row)

(1, 'Paul', 'Garrix', 'Corporate', Decimal('6000.00'), 'paul.garrix@company.com')
(5, 'Tom', 'Page', 'Corporate', Decimal('5974.41'), None)
(6, 'Claudia', 'Conte', 'Corporate', Decimal('4714.12'), None)
(10, 'Victoria', 'Pollock', 'Corporate', Decimal('4789.53'), None)

In [31]:

# 26. Employees whose total sales are above average
cursor.execute("""
    SELECT e.first_name, e.last_name
    FROM employees e
    JOIN quarterly_sales qs ON e.id = qs.employee_id
    WHERE (qs.q1_2022 + qs.q2_2022 + qs.q3_2022 + qs.q4_2022) >
          (SELECT AVG(q1_2022 + q2_2022 + q3_2022 + q4_2022) FROM quarterly_sales);
""")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Paul', 'Garrix')
('Matthias', 'Johnson')
('Walter', 'Deer')

**\-- ðŸ“™ STEP 7: Advanced Ordering**

In [33]:
# 27. Bottom 3 earners
cursor.execute("SELECT TOP 3 * FROM employees ORDER BY monthly_salary ASC;")
rows = cursor.fetchall()
for row in rows:
	print(row)

(2, 'Astrid', 'Fox', 'Support', Decimal('2845.56'), None)
(8, 'Stephanie', 'Marx', 'Support', Decimal('2894.51'), None)
(3, 'Matthias', 'Johnson', 'Private Individuals', Decimal('3009.41'), None)

In [35]:
# 28. Highest Q3 seller
cursor.execute("""
	SELECT TOP 1 e.first_name, e.last_name, qs.q3_2022
	FROM employees e
	JOIN quarterly_sales qs ON e.id = qs.employee_id
	ORDER BY qs.q3_2022 DESC;
""")
row = cursor.fetchone()
print(row)

('Paul', 'Garrix', Decimal('24747.82'))

In [37]:
# 29. Employees who sold more than 10000 in Q1 or Q2
cursor.execute("""
	SELECT e.first_name, e.last_name, qs.q1_2022, qs.q2_2022
	FROM employees e
	JOIN quarterly_sales qs ON e.id = qs.employee_id
	WHERE qs.q1_2022 > 10000 OR qs.q2_2022 > 10000;
""")
rows = cursor.fetchall()
for row in rows:
	print(row)

('Matthias', 'Johnson', Decimal('12774.51'), Decimal('24784.31'))
('Lucy', 'Patterson', Decimal('5417.81'), Decimal('12846.23'))
('Walter', 'Deer', Decimal('18415.66'), Decimal('15279.37'))
('Stephanie', 'Marx', Decimal('3471.41'), Decimal('14789.25'))

In [39]:
# 30. Total sales for each quarter
cursor.execute("""
    SELECT
      SUM(q1_2022) AS total_q1,
      SUM(q2_2022) AS total_q2,
      SUM(q3_2022) AS total_q3,
      SUM(q4_2022) AS total_q4
    FROM quarterly_sales;
""")
totals = cursor.fetchone()
print("Total sales for each quarter:", totals)

Total sales for each quarter: (Decimal('68665.42'), Decimal('102936.19'), Decimal('89931.56'), Decimal('56985.71'))